Pranavgulati/Arduino_STM32/Utilities/IAR_STM32F0xx_KSK/stm320Fxx_ksk.c
/*************************************************************************
 *
 *    Used with ICCARM and AARM.
 *
 *    (c) Copyright IAR Systems 2012
 *
 *    File name   : stm320Fxx_ksk.c
 *    Description : board configuration
 *
 *    History :
 *    1. Date        : 14, February 2012
 *       Author      : Stanimir Bonev
 *       Description : Create
 *
 *
 *    $Revision: 103 $
 **************************************************************************/
#include <string.h>
#include "stm320Fxx_ksk.h"

static uint32_t CP_CalCntr = 0;
static uint32_t CP_Index = 0;
static uint32_t CB_Cal_Count[6];
static volatile uint32_t CB_Res = 0;
static volatile uint32_t CP_Error = 0;

#define CP_THRESHOLD_LEVEL  3000

GPIO_TypeDef* GPIO_PORT[LEDn] = {LED1_GPIO_PORT, LED2_GPIO_PORT, LED3_GPIO_PORT,
                                 LED4_GPIO_PORT};
const uint16_t GPIO_PIN[LEDn] = {LED1_PIN, LED2_PIN, LED3_PIN,
                                 LED4_PIN};
const uint32_t GPIO_CLK[LEDn] = {LED1_GPIO_CLK, LED2_GPIO_CLK, LED3_GPIO_CLK,
                                 LED4_GPIO_CLK};

GPIO_TypeDef* BUTTON_PORT[BUTTONn] = {USR1_BUTTON_GPIO_PORT, USR2_BUTTON_GPIO_PORT};

const uint16_t BUTTON_PIN[BUTTONn] = {USR1_BUTTON_PIN, USR2_BUTTON_PIN};

const uint32_t BUTTON_CLK[BUTTONn] = {USR1_BUTTON_GPIO_CLK, USR2_BUTTON_GPIO_CLK};

const uint16_t BUTTON_EXTI_LINE[BUTTONn] = {USR1_BUTTON_EXTI_LINE,
                                            USR2_BUTTON_EXTI_LINE
																						};

const uint16_t BUTTON_PORT_SOURCE[BUTTONn] = {USR1_BUTTON_EXTI_PORT_SOURCE,
                                              USR2_BUTTON_EXTI_PORT_SOURCE
                                             };
								
const uint16_t BUTTON_PIN_SOURCE[BUTTONn] = {USR1_BUTTON_EXTI_PIN_SOURCE,
                                             USR2_BUTTON_EXTI_PIN_SOURCE
                                            };

const uint16_t BUTTON_IRQn[BUTTONn] = {USR1_BUTTON_EXTI_IRQn, USR2_BUTTON_EXTI_IRQn};

USART_TypeDef* COM_USART[COMn] = {RS232_COM1, UXT_COM2};

const uint32_t COM_USART_CLK[COMn] = {RS232_COM1_CLK, UXT_COM2_CLK};

GPIO_TypeDef* COM_TX_PORT[COMn] = {RS232_COM1_TX_GPIO_PORT, UXT_COM2_TX_GPIO_PORT};

GPIO_TypeDef* COM_RX_PORT[COMn] = {RS232_COM1_RX_GPIO_PORT, UXT_COM2_RX_GPIO_PORT};

const uint32_t COM_TX_PORT_CLK[COMn] = {RS232_COM1_TX_GPIO_CLK, UXT_COM2_TX_GPIO_CLK};

const uint32_t COM_RX_PORT_CLK[COMn] = {RS232_COM1_RX_GPIO_CLK, UXT_COM2_RX_GPIO_CLK};

const uint16_t COM_TX_PIN[COMn] = {RS232_COM1_TX_PIN, UXT_COM2_TX_PIN};

const uint16_t COM_RX_PIN[COMn] = {RS232_COM1_RX_PIN, UXT_COM2_RX_PIN};

const uint16_t COM_TX_PIN_SOURCE[COMn] = {RS232_COM1_TX_SOURCE, UXT_COM2_TX_SOURCE};

const uint16_t COM_RX_PIN_SOURCE[COMn] = {RS232_COM1_RX_SOURCE, UXT_COM2_RX_SOURCE};

const uint16_t COM_TX_AF[COMn] = {RS232_COM1_TX_AF, UXT_COM2_TX_AF};

const uint16_t COM_RX_AF[COMn] = {RS232_COM1_RX_AF, UXT_COM2_RX_AF};

const uint8_t COM_FLOW_CTRL[COMn] = {1, 0};

GPIO_TypeDef* COM_CTS_PORT[COMn] = {RS232_COM1_CTS_GPIO_PORT};

const uint32_t COM_CTS_PORT_CLK[COMn] = {RS232_COM1_CTS_GPIO_CLK};

const uint16_t COM_CTS_PIN[COMn] = {RS232_COM1_CTS_PIN};

const uint16_t COM_CTS_PIN_SOURCE[COMn] = {RS232_COM1_CTS_SOURCE};

const uint16_t COM_CTS_AF[COMn] = {RS232_COM1_CTS_AF};

GPIO_TypeDef* COM_RTS_PORT[COMn] = {RS232_COM1_RTS_GPIO_PORT};

const uint32_t COM_RTS_PORT_CLK[COMn] = {RS232_COM1_RTS_GPIO_CLK};

const uint16_t COM_RTS_PIN[COMn] = {RS232_COM1_RTS_PIN};

const uint16_t COM_RTS_PIN_SOURCE[COMn] = {RS232_COM1_RTS_SOURCE};

const uint16_t COM_RTS_AF[COMn] = {RS232_COM1_RTS_AF};

/**
  * @brief  Configures LED GPIO.
  * @param  Led: Specifies the Led to be configured.
  *   This parameter can be one of following parameters:
  *     @arg LED1
  *     @arg LED2
  *     @arg LED3
  *     @arg LED4
  * @retval None
  */
void LEDInit(Led_TypeDef Led)
{
  GPIO_InitTypeDef  GPIO_InitStructure;

  /* Enable the GPIO_LED Clock */
  RCC_AHBPeriphClockCmd(GPIO_CLK[Led], ENABLE);

  /* Configure the GPIO_LED pin */
  GPIO_InitStructure.GPIO_Pin = GPIO_PIN[Led];
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIO_PORT[Led], &GPIO_InitStructure);
  GPIO_PORT[Led]->BSRR = GPIO_PIN[Led];
}

/**
  * @brief  Turns selected LED On.
  * @param  Led: Specifies the Led to be set on.
  *   This parameter can be one of following parameters:
  *     @arg LED1
  *     @arg LED2
  *     @arg LED3
  *     @arg LED4
  * @retval None
  */
void LEDOn(Led_TypeDef Led)
{
  GPIO_PORT[Led]->BRR = GPIO_PIN[Led];
}

/**
  * @brief  Turns selected LED Off.
  * @param  Led: Specifies the Led to be set off.
  *   This parameter can be one of following parameters:
  *     @arg LED1
  *     @arg LED2
  *     @arg LED3
  *     @arg LED4
  * @retval None
  */
void LEDOff(Led_TypeDef Led)
{
  GPIO_PORT[Led]->BSRR = GPIO_PIN[Led];
}

/**
  * @brief  Toggles the selected LED.
  * @param  Led: Specifies the Led to be toggled.
  *   This parameter can be one of following parameters:
  *     @arg LED1
  *     @arg LED2
  *     @arg LED3
  *     @arg LED4
  * @retval None
  */
void LEDToggle(Led_TypeDef Led)
{
  GPIO_PORT[Led]->ODR ^= GPIO_PIN[Led];
}

/**
  * @brief  Configures Button GPIO and EXTI Line.
  * @param  Button: Specifies the Button to be configured.
  *   This parameter can be one of following parameters:
  *     @arg USR1_BUTTON: User Push Button 1
  *     @arg USR2_BUTTON: User Push Button 2
  * @param  Button_Mode: Specifies Button mode.
  *   This parameter can be one of following parameters:
  *     @arg BUTTON_MODE_GPIO: Button will be used as simple IO
  *     @arg BUTTON_MODE_EXTI: Button will be connected to EXTI line with interrupt
  *                     generation capability
  * @retval None
  */
void PBInit(Button_TypeDef Button, ButtonMode_TypeDef Button_Mode)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  EXTI_InitTypeDef EXTI_InitStructure;
  NVIC_InitTypeDef NVIC_InitStructure;

  /* Enable the BUTTON Clock */
  RCC_AHBPeriphClockCmd(BUTTON_CLK[Button], ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

  /* Configure Button pin as input */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_InitStructure.GPIO_Pin = BUTTON_PIN[Button];
  GPIO_Init(BUTTON_PORT[Button], &GPIO_InitStructure);

  if (Button_Mode == BUTTON_MODE_EXTI)
  {
    /* Connect Button EXTI Line to Button GPIO Pin */
    SYSCFG_EXTILineConfig(BUTTON_PORT_SOURCE[Button], BUTTON_PIN_SOURCE[Button]);

    /* Configure Button EXTI line */
    EXTI_InitStructure.EXTI_Line = BUTTON_EXTI_LINE[Button];
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);

    /* Enable and set Button EXTI Interrupt to the lowest priority */
    NVIC_InitStructure.NVIC_IRQChannel = BUTTON_IRQn[Button];
    NVIC_InitStructure.NVIC_IRQChannelPriority = 0x03;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;

    NVIC_Init(&NVIC_InitStructure);
  }
}

/**
  * @brief  Returns the selected Button state.
  * @param  Button: Specifies the Button to be checked.
  *   This parameter can be one of following parameters:
  *     @arg USR1_BUTTON: User Push Button 1
  *     @arg USR2_BUTTON: User Push Button 2
  * @retval The Button GPIO pin value.
  */
uint32_t PBGetState(Button_TypeDef Button)
{
  /* There is no Wakeup button on STM320518-EVAL. */
  return GPIO_ReadInputDataBit(BUTTON_PORT[Button], BUTTON_PIN[Button]);
}

/**
  * @brief  Configures COM port.
  * @param  COM: Specifies the COM port to be configured.
  *   This parameter can be one of following parameters:
  *     @arg COM1
  *     @arg COM2
  * @param  USART_InitStruct: pointer to a USART_InitTypeDef structure that
  *   contains the configuration information for the specified USART peripheral.
  * @retval None
  */
void COMInit(COM_TypeDef COM, USART_InitTypeDef* USART_InitStruct)
{
  GPIO_InitTypeDef GPIO_InitStructure;

