Pranavgulati/Arduino_STM32/Utilities/IAR_STM32F0xx_KSK/stm320Fxx_ksk.c
  /* Enable GPIO clock */
  RCC_AHBPeriphClockCmd(COM_TX_PORT_CLK[COM] | COM_RX_PORT_CLK[COM], ENABLE);

  if(COM1 == COM)
  {
    /* Enable USART clock */
    RCC_APB2PeriphClockCmd(COM_USART_CLK[COM], ENABLE);
  }
  else
  {
    /* Enable USART clock */
    RCC_APB1PeriphClockCmd(COM_USART_CLK[COM], ENABLE);
  }

	if(COM_FLOW_CTRL[COM])
	{
	  RCC_AHBPeriphClockCmd(COM_CTS_PORT_CLK[COM] | COM_RTS_PORT_CLK[COM], ENABLE);
	  /* Connect PXx to USARTx_CTS */
	  GPIO_PinAFConfig(COM_CTS_PORT[COM], COM_CTS_PIN_SOURCE[COM], COM_CTS_AF[COM]);
	  /* Connect PXx to USARTx_RTS */
	  GPIO_PinAFConfig(COM_RTS_PORT[COM], COM_RTS_PIN_SOURCE[COM], COM_RTS_AF[COM]);		

	  /* Configure USART CTS as alternate function push-pull */
	  GPIO_InitStructure.GPIO_Pin = COM_CTS_PIN[COM];
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	  GPIO_Init(COM_TX_PORT[COM], &GPIO_InitStructure);
	
	  /* Configure USART RTS as alternate function push-pull */
	  GPIO_InitStructure.GPIO_Pin = COM_RTS_PIN[COM];
	  GPIO_Init(COM_RX_PORT[COM], &GPIO_InitStructure);
	
	}
	
  /* Connect PXx to USARTx_Tx */
  GPIO_PinAFConfig(COM_TX_PORT[COM], COM_TX_PIN_SOURCE[COM], COM_TX_AF[COM]);

  /* Connect PXx to USARTx_Rx */
  GPIO_PinAFConfig(COM_RX_PORT[COM], COM_RX_PIN_SOURCE[COM], COM_RX_AF[COM]);

  /* Configure USART Tx as alternate function push-pull */
  GPIO_InitStructure.GPIO_Pin = COM_TX_PIN[COM];
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_Init(COM_TX_PORT[COM], &GPIO_InitStructure);

  /* Configure USART Rx as alternate function push-pull */
  GPIO_InitStructure.GPIO_Pin = COM_RX_PIN[COM];
  GPIO_Init(COM_RX_PORT[COM], &GPIO_InitStructure);

  /* USART configuration */
  USART_Init(COM_USART[COM], USART_InitStruct);

  /* Enable USART */
  USART_Cmd(COM_USART[COM], ENABLE);
}

/**
  * @brief  Initializes the ACC_I2C..
  * @param  None
  * @retval None
  */
void Acc_LowLevel_Init(void)
{
  GPIO_InitTypeDef  GPIO_InitStructure;
  EXTI_InitTypeDef  EXTI_InitStructure;
  NVIC_InitTypeDef  NVIC_InitStructure;

  RCC_AHBPeriphClockCmd(ACC_INT_GPIO_CLK, ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

  /*!< Configure ACC_INT pins: input */
  GPIO_InitStructure.GPIO_Pin = ACC_INT_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(ACC_INT_GPIO_PORT, &GPIO_InitStructure);

  SYSCFG_EXTILineConfig(ACC_INT_EXTI_PORT_SOURCE, ACC_INT_EXTI_PIN_SOURCE);

  /* Configure ACC INT line */
  EXTI_InitStructure.EXTI_Line = ACC_INT_EXTI_LINE;
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);

  /* Enable and set Button EXTI Interrupt to the lowest priority */
  NVIC_InitStructure.NVIC_IRQChannel = ACC_INT_EXTI_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPriority = 0x03;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;

  NVIC_Init(&NVIC_InitStructure);
}

/**
  * @brief  Initializes the UXT_I2C..
  * @param  None
  * @retval None
  */
void UXT_I2C_LowLevel_Init(void)
{
  GPIO_InitTypeDef  GPIO_InitStructure;

  /*!< UXT_I2C Periph clock enable */
  RCC_APB1PeriphClockCmd(UXT_I2C_CLK, ENABLE);

  /*!< UXT_I2C_SCL_GPIO_CLK, UXT_I2C_SDA_GPIO_CLK Periph clock enable */
  RCC_AHBPeriphClockCmd(UXT_I2C_SCL_GPIO_CLK | UXT_I2C_SDA_GPIO_CLK, ENABLE);

  /* Connect PXx to I2C_SCL */
  GPIO_PinAFConfig(UXT_I2C_SCL_GPIO_PORT, UXT_I2C_SCL_SOURCE, UXT_I2C_SCL_AF);

  /* Connect PXx to I2C_SDA */
  GPIO_PinAFConfig(UXT_I2C_SDA_GPIO_PORT, UXT_I2C_SDA_SOURCE, UXT_I2C_SDA_AF);

  /*!< Configure UXT_I2C pins: SCL */
  GPIO_InitStructure.GPIO_Pin = UXT_I2C_SCL_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;
  GPIO_Init(UXT_I2C_SCL_GPIO_PORT, &GPIO_InitStructure);

  /*!< Configure UXT_I2C pins: SDA */
  GPIO_InitStructure.GPIO_Pin = UXT_I2C_SDA_PIN;
  GPIO_Init(UXT_I2C_SDA_GPIO_PORT, &GPIO_InitStructure);
}

/**
  * @brief  Initializes the UXT SPI and put it into
  * @param  None
  * @retval None
  */
void UXT_SPI_LowLevel_Init(void)
{
  GPIO_InitTypeDef  GPIO_InitStructure;
  SPI_InitTypeDef   SPI_InitStructure;

  /*!< UXT_SPI_CS_GPIO, UXT_SPI_MOSI_GPIO, UXT_SPI_MISO_GPIO,
       and UXT_SPI_SCK_GPIO Periph clock enable */
  RCC_AHBPeriphClockCmd(UXT_SPI_SCK_GPIO_CLK | UXT_SPI_MISO_GPIO_CLK | UXT_SPI_MOSI_GPIO_CLK |
                        UXT_CS_GPIO_CLK , ENABLE);

  /*!< UXT_SPI Periph clock enable */
  RCC_APB2PeriphClockCmd(UXT_SPI_CLK, ENABLE);

  /*!< Configure UXT_SPI pins: SCK */
  GPIO_InitStructure.GPIO_Pin = UXT_SPI_SCK_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_UP;
  GPIO_Init(UXT_SPI_SCK_GPIO_PORT, &GPIO_InitStructure);

  /*!< Configure UXT_SPI pins: MISO */
  GPIO_InitStructure.GPIO_Pin = UXT_SPI_MISO_PIN;
  GPIO_Init(UXT_SPI_MISO_GPIO_PORT, &GPIO_InitStructure);

  /*!< Configure UXT_SPI pins: MOSI */
  GPIO_InitStructure.GPIO_Pin = UXT_SPI_MOSI_PIN;
  GPIO_Init(UXT_SPI_MOSI_GPIO_PORT, &GPIO_InitStructure);

  /*!< Configure UXT_SPI_CS_PIN pin: UXT Card CS pin */
  GPIO_InitStructure.GPIO_Pin = UXT_CS_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(UXT_CS_GPIO_PORT, &GPIO_InitStructure);

  /* Connect PXx to UXT_SPI_SCK */
  GPIO_PinAFConfig(UXT_SPI_SCK_GPIO_PORT, UXT_SPI_SCK_SOURCE, UXT_SPI_SCK_AF);

