Pranavgulati/Arduino_STM32/Utilities/IAR_STM32F0xx_KSK/stm320Fxx_ksk.c
  /* Connect PXx to UXT_SPI_MISO */
  GPIO_PinAFConfig(UXT_SPI_MISO_GPIO_PORT, UXT_SPI_MISO_SOURCE, UXT_SPI_MISO_AF);

  /* Connect PXx to UXT_SPI_MOSI */
  GPIO_PinAFConfig(UXT_SPI_MOSI_GPIO_PORT, UXT_SPI_MOSI_SOURCE, UXT_SPI_MOSI_AF);

  /*!< UXT_SPI Config */
  SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
  SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
  SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
  SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
  SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2;

  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
  SPI_InitStructure.SPI_CRCPolynomial = 7;
  SPI_Init(UXT_SPI, &SPI_InitStructure);

  SPI_RxFIFOThresholdConfig(UXT_SPI, SPI_RxFIFOThreshold_QF);

  SPI_Cmd(UXT_SPI, ENABLE); /*!< UXT_SPI enable */
}

/**
  * @brief  Initializes the UXT PWR control
  * @param  None
  * @retval None
  */
void UXT_PWR_Init(void)
{
  GPIO_InitTypeDef  GPIO_InitStructure;

  /* Enable the PWR Port Clock */
  RCC_AHBPeriphClockCmd(UXT_PWR_GPIO_CLK, ENABLE);

  /* Configure the PWR pin */
  GPIO_InitStructure.GPIO_Pin = UXT_PWR_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(UXT_PWR_GPIO_PORT, &GPIO_InitStructure);
  UXT_PWR_GPIO_PORT->BSRR = UXT_PWR_PIN;
}

/**
  * @brief  Enable/disable the UXT PWR
  * @param  Pwr
  * @retval None
  */
void UXT_PWR_Ctrl(PWR_CtrlDef Pwr)
{
	if(PWR_OFF == Pwr)
	{			
  	UXT_PWR_GPIO_PORT->BSRR = UXT_PWR_PIN;
	}
	else
	{			
  	UXT_PWR_GPIO_PORT->BRR = UXT_PWR_PIN;
	}
}

/**
  * @brief  Initializes the CEC_I2C..
  * @param  None
  * @retval None
  */
void CEC_I2C_LowLevel_Init(void)
{
  GPIO_InitTypeDef  GPIO_InitStructure;

  /*!< CEC_I2C Periph clock enable */
  RCC_APB1PeriphClockCmd(CEC_I2C_CLK, ENABLE);

  /* Configure the I2C clock source. The clock is derived from the HSI */
  RCC_I2CCLKConfig(RCC_I2C1CLK_HSI);

  /*!< CEC_I2C_SCL_GPIO_CLK, CEC_I2C_SDA_GPIO_CLK Periph clock enable */
  RCC_AHBPeriphClockCmd(CEC_I2C_SCL_GPIO_CLK | CEC_I2C_SDA_GPIO_CLK, ENABLE);

  /* Connect PXx to I2C_SCL */
  GPIO_PinAFConfig(CEC_I2C_SCL_GPIO_PORT, CEC_I2C_SCL_SOURCE, CEC_I2C_SCL_AF);

  /* Connect PXx to I2C_SDA */
  GPIO_PinAFConfig(CEC_I2C_SDA_GPIO_PORT, CEC_I2C_SDA_SOURCE, CEC_I2C_SDA_AF);

  /*!< Configure CEC_I2C pins: SCL */
  GPIO_InitStructure.GPIO_Pin = CEC_I2C_SCL_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;
  GPIO_Init(CEC_I2C_SCL_GPIO_PORT, &GPIO_InitStructure);

  /*!< Configure CEC_I2C pins: SDA */
  GPIO_InitStructure.GPIO_Pin = CEC_I2C_SDA_PIN;
  GPIO_Init(CEC_I2C_SDA_GPIO_PORT, &GPIO_InitStructure);
}

/**
  * @brief  Initializes the DAT ...
  * @param  None
  * @retval None
  */
void AudioOut_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;

  /* DAC Periph clock enable */
  RCC_APB1PeriphClockCmd(DAC_CLK, ENABLE);

  /* GPIOA clock enable */
  RCC_AHBPeriphClockCmd(AUDIO_OUT_GPIO_CLK, ENABLE);

  /* Configure PA.04 (DAC_OUT1) as analog */
  GPIO_InitStructure.GPIO_Pin =  AUDIO_OUT_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(AUDIO_OUT_GPIO_PORT, &GPIO_InitStructure);

  DAC_DeInit();
}

/**
  * @brief  Initializes the ADC TRIM ...
  * @param  None
  * @retval None
  */
void Trim_Init(void)
{
ADC_InitTypeDef          ADC_InitStructure;
GPIO_InitTypeDef         GPIO_InitStructure;

  /* TRIM GPIO Periph clock enable */
  RCC_AHBPeriphClockCmd(TRIM_GPIO_CLK, ENABLE);

  /* TRIM ADC Periph clock enable */
  RCC_APB2PeriphClockCmd(TRIM_ADC_CLK, ENABLE);

  /* Configure TRIM as analog input */
  GPIO_InitStructure.GPIO_Pin = TRIM_PIN ;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL ;
  GPIO_Init(TRIM_GPIO_PORT, &GPIO_InitStructure);

 	/* ADC DeInit */
  ADC_DeInit(TRIM_ADC);

  /* Initialize ADC structure */
  ADC_StructInit(&ADC_InitStructure);

  /* Configure the TRIM ADC in a 12 bits resolutuion */
  ADC_InitStructure.ADC_Resolution = ADC_Resolution_12b;
  ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
  ADC_InitStructure.ADC_ExternalTrigConvEdge = ADC_ExternalTrigConvEdge_None;
  ADC_InitStructure.ADC_ExternalTrigConv =  ADC_ExternalTrigConv_T1_TRGO;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  ADC_InitStructure.ADC_ScanDirection = ADC_ScanDirection_Upward;
  ADC_Init(TRIM_ADC, &ADC_InitStructure);

  /* Convert the TRIM Channel with 239.5 Cycles as sampling time */
  ADC_ChannelConfig(TRIM_ADC, TRIM_ADC_CHANNEL, ADC_SampleTime_239_5Cycles);

  /* ADC Calibration */
  ADC_GetCalibrationFactor(TRIM_ADC);

  /* Enable ADCperipheral[PerIdx] */
  ADC_Cmd(TRIM_ADC, ENABLE);

  /* Wait the ADCEN falg */
  while(!ADC_GetFlagStatus(TRIM_ADC, ADC_FLAG_ADEN));
}

/**
  * @brief  Initializes the ADC Distance sensor ...
  * @param  None
  * @retval None
  */
void Dist_Init(void)
{
ADC_InitTypeDef          ADC_InitStructure;
GPIO_InitTypeDef         GPIO_InitStructure;

  /* DIST GPIO Periph clock enable */
  RCC_AHBPeriphClockCmd(DIST_GPIO_CLK, ENABLE);

  /* DIST ADC Periph clock enable */
  RCC_APB2PeriphClockCmd(DIST_ADC_CLK, ENABLE);

  /* Configure DIST as analog input */
  GPIO_InitStructure.GPIO_Pin = DIST_PIN ;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL ;
  GPIO_Init(DIST_GPIO_PORT, &GPIO_InitStructure);

 	/* ADC DeInit */
  ADC_DeInit(DIST_ADC);

  /* Initialize ADC structure */
  ADC_StructInit(&ADC_InitStructure);

  /* Configure the TRIM ADC in a 12 bits resolutuion */
  ADC_InitStructure.ADC_Resolution = ADC_Resolution_12b;
  ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
  ADC_InitStructure.ADC_ExternalTrigConvEdge = ADC_ExternalTrigConvEdge_None;
  ADC_InitStructure.ADC_ExternalTrigConv =  ADC_ExternalTrigConv_T1_TRGO;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  ADC_InitStructure.ADC_ScanDirection = ADC_ScanDirection_Upward;
  ADC_Init(DIST_ADC, &ADC_InitStructure);

