Pranavgulati/Arduino_STM32/Utilities/IAR_STM32F0xx_KSK/stm320Fxx_ksk.c
  /* Convert the DIST Channel with 239.5 Cycles as sampling time */
  ADC_ChannelConfig(DIST_ADC, DIST_ADC_CHANNEL, ADC_SampleTime_239_5Cycles);

  /* ADC Calibration */
  ADC_GetCalibrationFactor(DIST_ADC);

  /* Enable ADCperipheral[PerIdx] */
  ADC_Cmd(DIST_ADC, ENABLE);

  /* Wait the ADCEN falg */
  while(!ADC_GetFlagStatus(DIST_ADC, ADC_FLAG_ADEN));
}

/**
  * @brief  Initializes the ADC Light sensor ...
  * @param  None
  * @retval None
  */
void Light_Init(void)
{
ADC_InitTypeDef          ADC_InitStructure;
GPIO_InitTypeDef         GPIO_InitStructure;

  /* LIGHT GPIO Periph clock enable */
  RCC_AHBPeriphClockCmd(LIGHT_GPIO_CLK | LIGHT_PWR_GPIO_CLK, ENABLE);

  /* LIGHT ADC Periph clock enable */
  RCC_APB2PeriphClockCmd(LIGHT_ADC_CLK, ENABLE);

  /* Configure LIGHT as analog input */
  GPIO_InitStructure.GPIO_Pin = LIGHT_PIN ;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL ;
  GPIO_Init(LIGHT_GPIO_PORT, &GPIO_InitStructure);

  /* Configure LIGHT_PWR_PIN pin: Light sensor shutdown pin */
  GPIO_InitStructure.GPIO_Pin = LIGHT_PWR_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(LIGHT_PWR_GPIO_PORT, &GPIO_InitStructure);
  LIGHT_PWR_GPIO_PORT->BSRR = LIGHT_PWR_PIN;

	/* ADC DeInit */
  ADC_DeInit(LIGHT_ADC);

  /* Initialize ADC structure */
  ADC_StructInit(&ADC_InitStructure);

  /* Configure the LIGHT ADC in a 12 bits resolutuion */
  ADC_InitStructure.ADC_Resolution = ADC_Resolution_12b;
  ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
  ADC_InitStructure.ADC_ExternalTrigConvEdge = ADC_ExternalTrigConvEdge_None;
  ADC_InitStructure.ADC_ExternalTrigConv =  ADC_ExternalTrigConv_T1_TRGO;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  ADC_InitStructure.ADC_ScanDirection = ADC_ScanDirection_Upward;
  ADC_Init(LIGHT_ADC, &ADC_InitStructure);

  /* Convert the LIGHT Channel with 239.5 Cycles as sampling time */
  ADC_ChannelConfig(LIGHT_ADC, LIGHT_ADC_CHANNEL, ADC_SampleTime_239_5Cycles);

  /* ADC Calibration */
  ADC_GetCalibrationFactor(LIGHT_ADC);

  /* Enable ADCperipheral[PerIdx] */
  ADC_Cmd(LIGHT_ADC, ENABLE);

  /* Wait the ADCEN falg */
  while(!ADC_GetFlagStatus(LIGHT_ADC, ADC_FLAG_ADEN));
}

/**
  * @brief  Light sensor power control ...
  * @param  Pwr
  * @retval None
  */
void Light_Ctrl(PWR_CtrlDef Pwr)
{
	if(PWR_OFF == Pwr)
	{			
  	LIGHT_PWR_GPIO_PORT->BSRR = LIGHT_PWR_PIN;
	}
	else
	{			
  	LIGHT_PWR_GPIO_PORT->BRR = LIGHT_PWR_PIN;
	}
}

/**
  * @brief  Touch sensing buttons calibration ...
  * @param  None
  * @retval uint32_t 0 - pass 1 - fault
  */
uint32_t CP_Calibrate(void)
{
  uint32_t status;
  CP_CalCntr = 0;
  memset(CB_Cal_Count,0,sizeof(CB_Cal_Count));
  CP_CalCntr = 8;
  while(CP_CalCntr);
  status = CB_GetStatus();
  if(!status)
  {
    // calibration pass
    for(int i = 0; i < sizeof(CB_Cal_Count)/sizeof(CB_Cal_Count[0]); i++)
    {
      CB_Cal_Count[i] /= 8+3;
    }
  }
  return status;
}

/**
  * @brief  Touch sensing buttons initialization ...
  * @param  None
  * @retval uint32_t 0 - pass 1 - fault
  */
uint32_t CB_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  NVIC_InitTypeDef NVIC_InitStructure;
  CP_Index = 0;
  CB_Res = 0;
  CP_CalCntr = 0;
  memset(CB_Cal_Count,0,sizeof(CB_Cal_Count));

  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_TS | RCC_AHBPeriph_GPIOB | RCC_AHBPeriph_GPIOC, ENABLE);

  GPIO_PinAFConfig(GPIOB, GPIO_PinSource0, GPIO_AF_3);
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource1, GPIO_AF_3);
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource2, GPIO_AF_3);
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource3, GPIO_AF_3);
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource4, GPIO_AF_3);
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource6, GPIO_AF_3);
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource7, GPIO_AF_3);
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource5, GPIO_AF_0);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2
                              | GPIO_Pin_3 | GPIO_Pin_4 | GPIO_Pin_6
                              | GPIO_Pin_7;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOC, &GPIO_InitStructure);

  TSC->CR  = (0xFUL << 28)  /* Charge transfer pulse high */
           | (0xFUL << 24)  /* Charge transfer pulse low */
           | (6UL   <<  5)  /* Max count value */
           ;
  /* Disable I/O hysteresis */
  TSC->IOHCR &= ~(  (0xFul << 8)  /* Group 3 */
                  | (0xFul <<16)  /* Group 5 */
                  );
  /* Enable analog switches */
  TSC->IOASCR = 0;
  TSC->IOSCR = (1UL << 8)      /* PC5 */
             | (1UL << 16)      /* PB3 */
             ;

  TSC->IOCCR = (  (1UL << (CP_Index+9))
                | (1UL << (CP_Index+17))
               );
  TSC->IOGCSR = (1UL << 2)      /* Group 3 */
              | (1UL << 4)      /* Group 5 */
              ;

  TSC->ICR = 3; /* clear EOAIE and MCEIE  */
  TSC->IER = 3; /* enable EOAIE and MCEIE  */

  /* Enable and set Button EXTI Interrupt to the lowest priority */
  NVIC_InitStructure.NVIC_IRQChannel = TS_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPriority = 0x03;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;

  NVIC_Init(&NVIC_InitStructure);
  TSC->CR |= 3;

  return CP_Calibrate();
}

/**
  * @brief  Touch sensing buttons interrupt handler ...
  * @param  None
  * @retval None
  */
void CB_Handler(void)
{
  static uint32_t sycn = 0;
  if((1UL << 1) & TSC->ISR)
  {
    /* Max count error */
    TSC->ICR = 2;
    sycn = CP_CalCntr = 0;
    CP_Error = 1;
  }
  else if((1UL << 0) & TSC->ISR)
  {
    /* End of acquisition */
    TSC->ICR = 1;

    if(sycn && CP_CalCntr)
    {
      /* Calibration data collection */
      CB_Cal_Count[CP_Index]   += TSC->IOGXCR[3-1];
      CB_Cal_Count[CP_Index+3] += TSC->IOGXCR[5-1];
    }
    else
    {
      /* Buttons' state data collection */
      if( CB_Cal_Count[CP_Index] > TSC->IOGXCR[3-1])
      {
        CB_Res |= 1UL << CP_Index;
      }
      else
      {
        CB_Res &=~(1UL << CP_Index);
      }

      if(CB_Cal_Count[CP_Index+3] > TSC->IOGXCR[5-1])
      {
        CB_Res |= (1UL << (CP_Index+3));
      }
      else
      {
        CB_Res &=~(1UL << (CP_Index+3));
      }
    }
    /*  Next channel */
    if(++CP_Index >= 3)
    {
      CP_Index = 0;
      if(!sycn)
      {
        sycn = !!CP_CalCntr;
      }
      else if(CP_CalCntr)
      {
        --CP_CalCntr;
      }
      else
      {
        sycn = 0;
      }
    }
    TSC->IOCCR = ((1UL << (CP_Index+9)) | (1UL << (CP_Index+17)));
    /*  Start new acquisition*/
    TSC->CR |= 2;
  }
}

/**
  * @brief  Return state of touch buttons ...
  * @param  None
  * @retval uint32_t 0 - no touched 1- touched
  */
uint32_t CB_GetState(void)
{
	return CB_Res;
}

/**
  * @brief  Return status of touch buttons ...
  * @param  None
  * @retval uint32_t 1 - Max count error
  */
uint32_t CB_GetStatus(void)
{
  uint32_t ret = CP_Error;
	return ret;
}
